In [1]:
import pandas as pd

In [2]:
returns=pd.read_csv('data/Global Superstore Returns 2016_zh-CN.csv')

In [3]:
returns.columns.values

array(['已退回', '订单 ID', '地区'], dtype=object)

In [5]:
returns.columns=[x.strip() for x in returns.columns.values]

In [6]:
returns.columns

Index(['已退回', '订单 ID', '地区'], dtype='object')

In [ ]:
df_i.columns = [x.strip() for x in df_i.columns.values]

In [3]:
returns.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1079 entries, 0 to 1078
Data columns (total 3 columns):
已退回      1079 non-null object
订单 ID    1079 non-null object
地区       1079 non-null object
dtypes: object(3)
memory usage: 25.4+ KB

In [5]:
returns.memory_usage(deep=True)

Index       80
已退回      90636
订单 ID    86461
地区       94422
dtype: int64

In [6]:
sorted(returns["已退回"].unique())

['是']

In [7]:
df=pd.DataFrame({'ID':[100,101,102,103],'quality':['good','very good','good','excellent']})

In [8]:
df

    ID    quality
0  100       good
1  101  very good
2  102       good
3  103  excellent

In [9]:
df.sort_values('quality')

    ID    quality
3  103  excellent
0  100       good
2  102       good
1  101  very good

In [20]:
df['quality']=df.quality.astype('category', ordered=True, categories=['good','very good','excellent'])

C:\Users\jucy\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: specifying 'categories' or 'ordered' in .astype() is deprecated; pass a CategoricalDtype instead
  """Entry point for launching an IPython kernel.

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
ID         4 non-null int64
quality    4 non-null category
dtypes: category(1), int64(1)
memory usage: 220.0 bytes

In [24]:
df.sort_values('quality')#以category排序

    ID    quality
0  100       good
2  102       good
1  101  very good
3  103  excellent

In [25]:
df.loc[df.quality>'good',:]#可以排序，之后比较

    ID    quality
1  101  very good
3  103  excellent

In [26]:
returns.head()

  已退回                     订单 ID    地区
0   是  CA-2012-SA20830140-41210  美国中部
1   是  IN-2012-PB19210127-41259    东亚
2   是  CA-2012-SC20095140-41174  美国中部
3   是    IN-2015-JH158207-42140   大洋洲
4   是    IN-2014-LC168857-41747   大洋洲

In [36]:
areas=["已退回","地区"]

In [37]:
x=returns.loc[:,areas]

In [38]:
x.shape

(1079, 2)

In [42]:
returns.sample(n=3,random_state=42)

    已退回                     订单 ID   地区
423   是   MX-2015-MY1829582-42321  中美洲
548   是  ES-2015-DK13375139-42082   北欧
730   是   MX-2014-TM2149039-41923  中美洲

In [43]:
a=returns.sample(frac=0.75,random_state=99)#0.75的数据

In [44]:
a.index

Int64Index([733, 453, 704, 177, 764, 595, 814, 933, 759, 931,
            ...
            404, 241, 599, 346,  97, 116, 201, 995, 479, 323],
           dtype='int64', length=809)

In [49]:
column=['back','dingdan','areas']
returns.columns=column
returns.head()

  back                   dingdan areas
0    是  CA-2012-SA20830140-41210  美国中部
1    是  IN-2012-PB19210127-41259    东亚
2    是  CA-2012-SC20095140-41174  美国中部
3    是    IN-2015-JH158207-42140   大洋洲
4    是    IN-2014-LC168857-41747   大洋洲

In [52]:
returns["yes"]=returns.back.map({"是":1,"否":0})

In [53]:
returns.head()

  back                   dingdan areas  yes
0    是  CA-2012-SA20830140-41210  美国中部    1
1    是  IN-2012-PB19210127-41259    东亚    1
2    是  CA-2012-SC20095140-41174  美国中部    1
3    是    IN-2015-JH158207-42140   大洋洲    1
4    是    IN-2014-LC168857-41747   大洋洲    1

In [57]:
pd.get_dummies(returns.yes).head()#如果有两个值就可以有两行，例如第一行（1,0）

   1
0  1
1  1
2  1
3  1
4  1

In [58]:
pd.get_dummies(returns.yes,prefix='back').head()#行名前面加一个东西

   back_1
0       1
1       1
2       1
3       1
4       1

In [59]:
returns.areas.value_counts()

西欧       121
中美洲      117
大洋洲       78
美国西部      72
美国东部      69
东南亚       64
南美        61
南亚        58
南欧        55
东亚        53
西亚        50
美国南部      44
北欧        43
美国中部      42
加勒比海      31
西非        29
北非        26
东欧        24
南部非洲      11
东非        11
中非        10
加拿大东部      5
中亚         4
西加拿大       1
Name: areas, dtype: int64

In [63]:
areas_dummies=pd.get_dummies(returns.areas,prefix="areas").iloc[:5,:3]

In [64]:
train=pd.concat([returns,areas_dummies],axis=1)#[这里面是哪些进行整理]，axis是横还是纵整合

In [65]:
train.head()

  areas  areas_东亚  areas_东南亚  areas_东欧 back                   dingdan  yes
0  美国中部       NaN        NaN       NaN    是  CA-2012-SA20830140-41210  1.0
1    东亚       NaN        NaN       NaN    是  IN-2012-PB19210127-41259  1.0
2  美国中部       NaN        NaN       NaN    是  CA-2012-SC20095140-41174  1.0
3   大洋洲       NaN        NaN       NaN    是    IN-2015-JH158207-42140  1.0
4   大洋洲       NaN        NaN       NaN    是    IN-2014-LC168857-41747  1.0

In [69]:
pd.get_dummies(returns,columns=['back']).head()#进行了替代

                    dingdan areas  yes  back_是
0  CA-2012-SA20830140-41210  美国中部    1       1
1  IN-2012-PB19210127-41259    东亚    1       1
2  CA-2012-SC20095140-41174  美国中部    1       1
3    IN-2015-JH158207-42140   大洋洲    1       1
4    IN-2014-LC168857-41747   大洋洲    1       1

In [70]:
pd.get_dummies(returns,columns=['back'],drop_first=True).head()
#因为第一个选择进行删除了

                    dingdan areas  yes
0  CA-2012-SA20830140-41210  美国中部    1
1  IN-2012-PB19210127-41259    东亚    1
2  CA-2012-SC20095140-41174  美国中部    1
3    IN-2015-JH158207-42140   大洋洲    1
4    IN-2014-LC168857-41747   大洋洲    1

In [76]:
returns.dingdan.str.slice(-5,).head()#截取后面五个数字

0    41210
1    41259
2    41174
3    42140
4    41747
Name: dingdan, dtype: object

In [80]:
returns.dingdan.str.slice(0,2).head()#截取前面两个数字

0    CA
1    IN
2    CA
3    IN
4    IN
Name: dingdan, dtype: object

In [81]:
returns.dingdan.str.slice(0,2).astype(str).head()

0    CA
1    IN
2    CA
3    IN
4    IN
Name: dingdan, dtype: object

In [ ]:
ufo['time']=pd.to_datetime(ufo.time)#改变之前时间格式，转换为时间格式

In [ ]:
ufo.time.dt.hour/weekday/dayofyear#直接可以查询到当天的时间、星期等
#非常方便

In [83]:
ts=pd.to_datetime('1/1/1999')

In [ ]:
ufo.loc[ufo.time>=ts,:]#时间可以进行比较

In [ ]:
(ufo.time.max()-ufo.time.min()).days

In [84]:
%matplotlib inline

In [ ]:
ufo['year']=ufo.time.dt.year

In [ ]:
ufo.year.value_counts().sort_index().plot()#counts统计频次,之后依据年份进行排序，在之后画图

In [85]:
returns['ID']=returns.dingdan.str.slice(-5,)

In [90]:
returns['country']=returns.dingdan.str.slice(0,2)

In [91]:
returns.head()

  back                   dingdan areas  yes     ID country
0    是  CA-2012-SA20830140-41210  美国中部    1  41210      CA
1    是  IN-2012-PB19210127-41259    东亚    1  41259      IN
2    是  CA-2012-SC20095140-41174  美国中部    1  41174      CA
3    是    IN-2015-JH158207-42140   大洋洲    1  42140      IN
4    是    IN-2014-LC168857-41747   大洋洲    1  41747      IN

In [93]:
returns.country.duplicated().head()#是否存在重复，后面有重复就是true

0    False
1    False
2     True
3     True
4     True
Name: country, dtype: bool

In [95]:
returns.shape

(1079, 6)

In [94]:
returns.country.duplicated().sum()

1028

In [97]:
returns.duplicated().sum()

0

In [109]:
returns.loc[returns.country.duplicated(keep='first'),:].head()
#keep='first'是除了开始重复的值全部显示，first : Mark duplicates as True except for the first occurrence.
#'last' : Mark duplicates as True except for the last occurrence.
#False : Mark all duplicates as True.，

  back                   dingdan areas  yes     ID country
2    是  CA-2012-SC20095140-41174  美国中部    1  41174      CA
3    是    IN-2015-JH158207-42140   大洋洲    1  42140      IN
4    是    IN-2014-LC168857-41747   大洋洲    1  41747      IN
7    是  CA-2014-TB21280140-41724  美国中部    1  41724      CA
8    是  ES-2014-JF15295120-41924    南欧    1  41924      ES

In [131]:
a=returns.country.value_counts()
a.count()

51

In [116]:
a=returns.country.drop_duplicates(keep='last').shape
b=returns.country.drop_duplicates(keep=False).shape
print (a,b)

(51,) (15,)

In [132]:
returns.drop_duplicates(subset=['areas','country']).shape

(74, 6)

In [133]:
returns.country.isnull().sum()

0

In [ ]:
movies.loc[movies.content=='not rated','content']=np.nan
#把之前movies表格content列中的not rated 转换为空格

更改原表格中的数据,类似如下：

In [ ]:
returns=returns.loc[returns.raking>=9,:].copy()
returns.loc[0,'ranking']=150

In [134]:
returns.head()

  back                   dingdan areas  yes     ID country
0    是  CA-2012-SA20830140-41210  美国中部    1  41210      CA
1    是  IN-2012-PB19210127-41259    东亚    1  41259      IN
2    是  CA-2012-SC20095140-41174  美国中部    1  41174      CA
3    是    IN-2015-JH158207-42140   大洋洲    1  42140      IN
4    是    IN-2014-LC168857-41747   大洋洲    1  41747      IN

In [136]:
pd.set_option('display.max_rows',None)#展示全部的的，之前表格

In [140]:
pd.reset_option('display.max_rows')

In [144]:
returns=pd.read_csv('data/Global Superstore Returns 2016_zh-CN.csv')

In [145]:
returns.head()

  已退回                     订单 ID    地区
0   是  CA-2012-SA20830140-41210  美国中部
1   是  IN-2012-PB19210127-41259    东亚
2   是  CA-2012-SC20095140-41174  美国中部
3   是    IN-2015-JH158207-42140   大洋洲
4   是    IN-2014-LC168857-41747   大洋洲

In [147]:
import numpy as np

In [148]:
arr=np.random.rand(4,2)
arr

array([[ 0.36547362,  0.10806578],
       [ 0.22804584,  0.61039825],
       [ 0.44779456,  0.36915584],
       [ 0.43404616,  0.9969981 ]])

In [149]:
pd.DataFrame(arr,columns=['one','two'])

        one       two
0  0.365474  0.108066
1  0.228046  0.610398
2  0.447795  0.369156
3  0.434046  0.996998

In [150]:
pd.DataFrame({'student':np.arange(100,110,1),'test':np.random.randint(60,101,10)})

   student  test
0      100    85
1      101    63
2      102    79
3      103    99
4      104    97
5      105    89
6      106    83
7      107    61
8      108    85
9      109    97

In [151]:
pd.DataFrame({'student':np.arange(100,110,1),'test':np.random.randint(60,101,10)}).set_index('student')

         test
student
100        88
101        69
102        87
103        60
104        72
105        98
106        61
107        71
108        88
109        61

In [152]:
s=pd.Series(['round','square'],index=['c','b'],name='shape')

In [153]:
s

c     round
b    square
Name: shape, dtype: object

In [156]:
df=pd.DataFrame({'id':[100,101,102],'color':['red','blue','red']},index=['a','b','c'])

In [157]:
df

  color   id
a   red  100
b  blue  101
c   red  102

In [158]:
pd.concat([df,s],axis=1)#两个可以合并

  color   id   shape
a   red  100     NaN
b  blue  101  square
c   red  102   round

In [159]:
returns.head()

  已退回                     订单 ID    地区
0   是  CA-2012-SA20830140-41210  美国中部
1   是  IN-2012-PB19210127-41259    东亚
2   是  CA-2012-SC20095140-41174  美国中部
3   是    IN-2015-JH158207-42140   大洋洲
4   是    IN-2014-LC168857-41747   大洋洲

In [160]:
returns['yes']=returns["已退回"].map({"是":1,"不是":0})

In [162]:
returns.loc[:4,["已退回",'yes']]

  已退回  yes
0   是    1
1   是    1
2   是    1
3   是    1
4   是    1

In [176]:
returns['len']=returns.id.apply(len)

np.ceil(x)#标量x的最小值是最小的整数i，因此 i> = x。它通常表示为

In [177]:
returns.len.head()

0    24
1    24
2    24
3    22
4    22
Name: len, dtype: int64

In [167]:
np.ceil(9.5)

10.0

In [168]:
returns.head()

  已退回                     订单 ID    地区  yes  len
0   是  CA-2012-SA20830140-41210  美国中部    1   24
1   是  IN-2012-PB19210127-41259    东亚    1   24
2   是  CA-2012-SC20095140-41174  美国中部    1   24
3   是    IN-2015-JH158207-42140   大洋洲    1   22
4   是    IN-2014-LC168857-41747   大洋洲    1   22

In [170]:
column=['back','id','areas','yes','len']
returns.columns=column
returns.head()

  back                        id areas  yes  len
0    是  CA-2012-SA20830140-41210  美国中部    1   24
1    是  IN-2012-PB19210127-41259    东亚    1   24
2    是  CA-2012-SC20095140-41174  美国中部    1   24
3    是    IN-2015-JH158207-42140   大洋洲    1   22
4    是    IN-2014-LC168857-41747   大洋洲    1   22

In [171]:
returns.id.str.split('-').head()

0    [CA, 2012, SA20830140, 41210]
1    [IN, 2012, PB19210127, 41259]
2    [CA, 2012, SC20095140, 41174]
3      [IN, 2015, JH158207, 42140]
4      [IN, 2014, LC168857, 41747]
Name: id, dtype: object

In [173]:
def get_element(my_list,position):
    return my_list[position]

In [181]:
returns['country']=returns.id.str.split('-').apply(get_element,position=0)

In [183]:
returns['year']=returns.id.str.split('-').apply(lambda x:x[1])

In [184]:
returns.head()

  back                        id areas  yes  len country  year
0    是  CA-2012-SA20830140-41210  美国中部    1   24      CA  2012
1    是  IN-2012-PB19210127-41259    东亚    1   24      IN  2012
2    是  CA-2012-SC20095140-41174  美国中部    1   24      CA  2012
3    是    IN-2015-JH158207-42140   大洋洲    1   22      IN  2015
4    是    IN-2014-LC168857-41747   大洋洲    1   22      IN  2014

In [188]:
returns['dingdan']=returns.id.str.slice(8,)

In [189]:
returns.head()

,back,id,areas,yes,len,country,year,dingdan
0,是,CA-2012-SA20830140-41210,美国中部,1,24,CA,2012,SA20830140-41210
1,是,IN-2012-PB19210127-41259,东亚,1,24,IN,2012,PB19210127-41259
2,是,CA-2012-SC20095140-41174,美国中部,1,24,CA,2012,SC20095140-41174
3,是,IN-2015-JH158207-42140,大洋洲,1,22,IN,2015,JH158207-42140
4,是,IN-2014-LC168857-41747,大洋洲,1,22,IN,2014,LC168857-41747

In [192]:
returns.apply(max,axis=0)#最大值

back                              是
id         ZA-2015-SW10350146-42061
areas                            西非
yes                               1
len                              24
country                          ZA
year                           2015
dingdan             ZD2192548-41503
dtype: object

numpy.argmax(a, axis=None, out=None) 
返回沿轴axis最大值的索引。
array([[0, 1, 2],
       [3, 4, 5]])
>>> np.argmax(a)
5

In [198]:
returns.shape

(1079, 8)

In [202]:
returns.describe()

          yes          len         year
count  1079.0  1079.000000  1079.000000
mean      1.0    23.130677  2013.753475
std       0.0     0.709448     1.126681
min       1.0    21.000000  2012.000000
25%       1.0    23.000000  2013.000000
50%       1.0    23.000000  2014.000000
75%       1.0    24.000000  2015.000000
max       1.0    24.000000  2015.000000

In [200]:
returns.year=returns.year.astype(int)

In [206]:
returns.loc[:,['year','len']]=returns.loc[:,['year','len']].applymap(float)

更改了两列的数据类型

In [207]:
returns.head()

,back,id,areas,yes,len,country,year,dingdan
0,是,CA-2012-SA20830140-41210,美国中部,1,24.0,CA,2012.0,SA20830140-41210
1,是,IN-2012-PB19210127-41259,东亚,1,24.0,IN,2012.0,PB19210127-41259
2,是,CA-2012-SC20095140-41174,美国中部,1,24.0,CA,2012.0,SC20095140-41174
3,是,IN-2015-JH158207-42140,大洋洲,1,22.0,IN,2015.0,JH158207-42140
4,是,IN-2014-LC168857-41747,大洋洲,1,22.0,IN,2014.0,LC168857-41747